---
kind: enumMember
id: F:Autodesk.Revit.DB.WallFunction.Exterior
enum: Autodesk.Revit.DB.WallFunction
source: html/ccafc685-892f-511b-1db6-e7bf1116268d.htm
---
# Autodesk.Revit.DB.WallFunction.Exterior

An exterior wall.